tap "homebrew/bundle"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Styled terminal markdown viewer
brew "mdv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Ruby version manager
brew "rbenv"
# Safe, concurrent, practical language
brew "rust"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Keyboard customiser
cask "karabiner-elements"
# Find shortcuts for any installed application
cask "keyclu"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# YouTube music client
cask "ytmdesktop-youtube-music"
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "HP Smart", id: 1474276998
mas "Mail+ for Gmail", id: 1216244845
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Turtle Beach Audio Hub", id: 948410748
mas "WhatsApp", id: 310633997
